<?php

define('STATIC_URL', 'https://pairs-static.herokuapp.com');
define('OG_DIR_PATH', '/img/og/01/');
define('MAGIC_KEY', 928378193);

$titles = array(
    1 => '巧克力情侶檔',
    2 => '泰式檸檬魚情侶檔',
    3 => '棉花糖情侶檔',
    4 => '火辣泡菜情侶檔',
    5 => '葡萄酒情侶檔',
    6 => '懷石料理情侶檔',
    7 => '牛皮糖情侶檔',
    8 => '速食情侶檔',
    9 => '小當家私房菜情侶檔',
    10 => '香吉士的料理情侶檔',
    11 => '頂級茶葉情侶檔',
    12 => 'Pizza情侶檔'
);

$descriptions = array(
    1 => '雙方對愛情都抱有美麗的嚮往，加上對待親密關係人的溫柔態度，若兩人配對成功，絕對會甜蜜蜜到像剛出爐的香甜義大利巧克力！',
    2 => '他們總是堅持原則，在愛情裡也是如此，但在看似冷酷的外表下，雙方都有一顆細膩的心，因此體驗檸檬魚般的愛情酸甜，要好好坦誠相待唷！',
    3 => '可愛又軟軟的棉花糖，就是這配對的最佳形容 ♥ 兩人對生活與愛情的輕鬆態度，讓相處起來總是散發甜甜氣息！',
    4 => '看似穩重、冷靜的兩個人，其實面對愛情時都變得熱情奔放，如果配對他們，大概天天都像上演史密斯夫婦一樣熱烈！',
    5 => '心靈年齡都足夠成熟的兩人，經歷過人生與感情的許多波折，因此會特別珍惜彼此；彷彿葡萄酒般的香醇厚重，這一對令人聯想到天外奇蹟裡的老夫妻。彷彿葡萄酒般的濃厚純重，這一對的感情會歷久彌堅，也越來越濃烈。',
    6 => '感情世界裡意志堅定的兩人，談戀愛就象懷石料理一樣，一道道慢慢出，卻總讓人吃不膩。兩人細水長流，愛到海枯石爛、天荒地老！',
    7 => '黏踢踢情侶檔就是他們的最佳寫照，雖然看起來很不可思議，但兩人真的在一起，就會像牛皮糖一樣，無時無刻想和對方together！',
    8 => '對媒人感到很抱歉，但這兩人潛意識都是追求瞬間永恆的類型！就像速食一樣，快速地在一起，也會快速地確認彼此適不適合！',
    9 => '沒錯，就是那個特級廚師小當家！那些閃閃發亮的料理，形容著你們這對情侶！總是永遠都在放閃，考慮一下能看不能吃的我們吧！',
    10 => '雖然看起來不太可靠，大家也常常唱衰這個配對，但如同香吉士和他的料理，這個配對其實色香味俱全。兩人感情充沛，互補愉快的很！祝福你們喲~~~',
    11 => '兩人內斂又雋永的個性，讓彼此在感情路上能有走得長久。這會是一對傳統卻不古板的情侶，雖然可能平淡，但回甘後又是旁人無法體會的美好，還帶點些哲學的意味。',
    12 => '天天都精彩、配料繽紛的一個八卦，每隔一段時間就會發生點事情讓大家不講不過癮，是眾人關注的焦點，屬於一對非常顯眼、高調的配對（墨鏡）。'
);


/* generate random number using pid: 1~12 */
function getCategory($pid) {
    srand(MAGIC_KEY * $pid);
    return (rand() % 12) + 1;
}

function getTitle($pid, $name1, $name2) {
    global $titles;
    $cate = getCategory($pid);
    return '寶寶：' . $name1 . '跟' . $name2 . '屬於「' . $titles[$cate] . '」！你覺得配嗎？';
}

function getDescription($pid) {
    global $descriptions;
    $cate = getCategory($pid);
    return $descriptions[$cate];
}

function getImageURL($pid) {
    $cate = getCategory($pid);
    $cate_padded = sprintf("%02s", $cate);
    return STATIC_URL . OG_DIR_PATH . $cate_padded . '.jpg';
}

?>
